{
      "department": "Development",
      "id": "6693c867-fc98-422e-8915-f07cd2b5cbd4",
      "title": "Frontend Engineer (React)",
      "state": "published",
      "description": "\u003Cp\u003EWe’re seeking a design-focused Frontend Engineer who embraces AI-assisted development tools as essential components of their workflow. The ideal candidate will have both strong technical skills and a keen design sensibility, using tools like Cursor, Windsurf, and other AI assistants to accelerate development and elevate UI quality. You’ll be at the forefront of creating visually stunning interfaces that make complex financial workflows intuitive and engaging.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAbout us:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ERoot Systems is an early stage startup building an innovative platform to revolutionise how films are financed, distributed, and monetized. We're building a comprehensive digital ecosystem that serves as a permanent home for films, combining sophisticated rights management with cutting-edge fintech solutions. Our mission is to extend the commercial lifespan of films indefinitely while democratizing film investment through micro-investment opportunities.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYou’ll be responsible for:\u003C/strong\u003E\u003C/p\u003E\u003Cul\u003E \u003Cli\u003ECrafting beautiful, intuitive user interfaces with a strong emphasis on visual design and user experience\u003C/li\u003E \u003Cli\u003ELeveraging AI tools (Cursor, Windsurf, GitHub Copilot, etc.) daily to enhance productivity and UI innovation\u003C/li\u003E \u003Cli\u003ECreating sophisticated data visualizations that are both functional and visually compelling\u003C/li\u003E \u003Cli\u003EImplementing responsive, accessible interfaces that follow modern design principles\u003C/li\u003E \u003Cli\u003EBuilding and maintaining our design system and component library\u003C/li\u003E \u003Cli\u003ECollaborating with designers to translate concepts into polished, production-ready features\u003C/li\u003E \u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EOur Tech Stack\u003C/strong\u003E\u003C/p\u003E\u003Cul\u003E \u003Cli\u003EFrontend: React.js and TypeScript\u003C/li\u003E \u003Cli\u003EState Management: Redux / Zustand\u003C/li\u003E \u003Cli\u003EData Visualization: Recharts, D3.js\u003C/li\u003E \u003Cli\u003ETesting: Jest for unit testing, Cypress for e2e testing\u003C/li\u003E \u003Cli\u003ECI/CD: GitHub Actions\u003C/li\u003E \u003Cli\u003EInfrastructure: Docker\u003C/li\u003E \u003C/ul\u003E",
      "socialSharingDescription": "We’re seeking a design-focused Frontend Engineer who embraces AI-assisted development tools as essential components of their workflow. The ideal candidate will have both strong technical skills and a keen design sensibility, using tools like Cursor, Wi...",
      "employmentType": "Full-time",
      "benefitsSection": "\u003Cul\u003E \u003Cli\u003ECompetitive salary and benefits package included\u003C/li\u003E \u003Cli\u003EChance to work with major players in the film industry\u003C/li\u003E \u003Cli\u003EGear of your choice (laptop, mobile device)\u003C/li\u003E \u003Cli\u003EUnlimited data mobile plan\u003C/li\u003E \u003Cli\u003EProfessional development budget\u003C/li\u003E \u003Cli\u003EAccess to premium AI development tools and training\u003C/li\u003E \u003Cli\u003EPrivate health insurance\u003C/li\u003E \u003Cli\u003E5 weeks of paid vacation\u003C/li\u003E \u003Cli\u003EHelp with relocation to Athens, Greece (where applicable)\u003C/li\u003E \u003C/ul\u003E",
      "requirementsSection": "\u003Cul\u003E\u003Cul\u003E \u003Cli\u003E3+ years of professional experience with React.js\u003C/li\u003E \u003Cli\u003EStrong design sensibility and passion for creating exceptional user interfaces\u003C/li\u003E \u003Cli\u003EDemonstrated enthusiasm for and experience with AI-assisted development tools\u003C/li\u003E \u003Cli\u003EAbility to write effective prompts for AI tools to optimize development workflow\u003C/li\u003E \u003Cli\u003EStrong expertise in TypeScript and modern JavaScript (ES6+)\u003C/li\u003E \u003Cli\u003EProficiency with CSS, animations, and responsive design techniques\u003C/li\u003E \u003Cli\u003EExperience with data visualization libraries (e.g., Recharts, D3.js)\u003C/li\u003E \u003Cli\u003EEye for detail and commitment to pixel-perfect implementation\u003C/li\u003E \u003Cli\u003EWillingness to embrace AI tools as core components of your development workflow\u003C/li\u003E \u003Cli\u003EPassion for the intersection of technology and design\u003C/li\u003E \u003Cli\u003EAbility to think like both an engineer and a designer\u003C/li\u003E \u003Cli\u003EOpen-minded approach to adopting new tools and methodologies\u003C/li\u003E \u003C/ul\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ENice to Have\u003C/strong\u003E\u003C/p\u003E\u003Cul\u003E\u003Cul\u003E \u003Cli\u003EExperience with Figma or other design tools\u003C/li\u003E \u003Cli\u003EUnderstanding of design systems and component libraries\u003C/li\u003E \u003Cli\u003EBackground in or passion for the film industry or fintech\u003C/li\u003E \u003Cli\u003EKnowledge of WebSocket implementations for real-time features\u003C/li\u003E \u003Cli\u003EExperience with accessibility (WCAG) compliance\u003C/li\u003E \u003C/ul\u003E\u003C/ul\u003E",
      "url": "https://jobs.workable.com/view/dEEHacfvXTuV1QfeRRh4sm/remote-frontend-engineer-(react)-in-greece-at-root-systems",
      "language": "en",
      "locations": [
        "TELECOMMUTE",
        "Greece"
      ],
      "location": {
        "city": "",
        "subregion": null,
        "countryName": "Greece"
      },
      "created": "2025-07-16T00:00:00.000Z",
      "updated": "2025-07-16T00:00:00.000Z",
      "company": {
        "id": "25c521e6-a754-447c-90f2-5cc00e174896",
        "title": "Root Systems",
        "website": "http://rootsystems.gr",
        "image": "https://workablehr.s3.amazonaws.com/uploads/account/logo/623274/logo",
        "description": "\u003Cp\u003ERoot Systems is a stealth startup in its initial stages, undergoing development under a working title. Our mission is to revolutionize financial transactions and collaborations, starting with the creative ecosystem. We will provide rightsholders, distributors, and consumers with more control over their monetary transactions, while streamlining processes like project funding, subscription management, and revenue allocation. Our core feature is a digital roots system that acts as a connective medium between users, allowing funds to stream seamlessly within the network. Root Systems aspires to create a positive impact on society, guided by a common sense ethos, and a portion of all resources flows back into the ecosystem and towards those who need them the most.\u003C/p\u003E",
        "url": "https://jobs.workable.com/company/5EvHEdiCjhH6yX97QwqGnm/jobs-at-root-systems",
        "socialSharingDescription": "Root Systems is a stealth startup in its initial stages, undergoing development under a working title. Our mission is to revolutionize financial transactions and collaborations, starting with the creative ecosystem. We will provide rightsholders, distr..."
      },
      "workplace": "remote"
    }